# Arc

## Description
Procedure Arc creates an arc object, or a polyline object, in the active document. If p1 and p2 define a perfect square, an arc will be created, with its center point at the center of the square. If p1 and p2 define a rectangle, a polyline will be created which will represent the oval segment defined by the rectangle.

```pascal
PROCEDURE Arc(
				p1         : REAL;
				p2         : REAL;
				StartAngle : REAL;
				ArcAngle   : REAL);
```

```python

def vs.Arc(p1, p2, StartAngle, ArcAngle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p1|REAL|Top left coordinate of bounding box of oval defining the arc.|
|p2|REAL|Bottom right coordinate of bounding box of oval defining the arc.|
|StartAngle|REAL|Start angle of drawn arc.|
|ArcAngle|REAL|Sweep angle of drawn arc.|

## Examples
```pascal
Arc(0,0,2,2,45,90);

{draws an 90 degree arc with a start angle of 45 degrees}

```

## Version
Availability: from MiniCAD
## Category
* Objects - 2D